app/views/rentals/new.html.erb

  <p>
    <%= f.collection_select :user_ids, User.all, :id, :username %>
---
SELECT "users".* FROM "users"