app/controllers/rentals_controller.rb

SELECT "rentals".* FROM "rentals"
---
  def index
    @rentals = Rental.all

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @rental = Rental.find(params[:id])

INSERT INTO "rentals" ("title", "description", "photo_url", "rental_availability", "price", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Ibanez rg1000"], ["description", "Amazing Ibanez rg1000 mint conditions"], ["photo_url", "sdadsa"], ["rental_availability", 2019], ["price", 1200.0], ["user_id", 3]]
---
  def create
    @rental = Rental.new(rental_params)
    @rental.save

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @rental = Rental.find(params[:id])

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "rentals" SET "photo_url" = ? WHERE "rentals"."id" = ?  [["photo_url", "https://cdn.shopify.com/s/files/1/0758/4003/products/humbucker_2273_263773277.jpeg?v=1541213567"], ["id", 7]]
---
  def update
    @rental = Rental.find(params[:id])
    @rental.update(rental_params)

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "rentals" WHERE "rentals"."id" = ?  [["id", 2]]
---
  def destroy
    @rental = Rental.find(params[:id])
    @rental.destroy