app/controllers/sales_controller.rb

  def show
    @sale = Sale.find(params[:id])
---
SELECT  "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @sale = Sale.new(sale_params)
    @sale.save
---
INSERT INTO "sales" ("title", "description", "photo_url", "price", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Fender Statocaster 1962 reissue - USA"], ["description", "Fender"], ["photo_url", "dsasa"], ["price", 1000.0], ["user_id", 3]]

  def edit
    @sale = Sale.find(params[:id])
---
SELECT  "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @sale = Sale.find(params[:id])
    @sale.update(sale_params)
---
SELECT  "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "sales" SET "description" = ?, "photo_url" = ?, "price" = ? WHERE "sales"."id" = ?  [["description", "Amazing Fender Statocaster on sale!! Price is not negotiable "], ["photo_url", ""], ["price", 2500.0], ["id", 1]]