app/controllers/users_controller.rb

INSERT INTO "users" ("username", "first_name", "last_name", "email", "password") VALUES (?, ?, ?, ?, ?)  [["username", "Pablo123"], ["first_name", "Pablo"], ["last_name", "Escobar"], ["email", "pabeacobar@gmail.com"], ["password", "Password123"]]
---
  def create
    @user = User.new(user_params)
    @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "first_name" = ?, "last_name" = ? WHERE "users"."id" = ?  [["username", "Rabbiteeee"], ["first_name", "Rogereeee"], ["last_name", "Rabbiteee"], ["id", 4]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)