app/controllers/wellcomes_controller.rb

SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "rentals"
SELECT COUNT(*) FROM "sales"
---
  def welcome
    @total_users = User.all.count
    @total_ads = Sale.all.count + Rental.all.count