app/models/rental.rb

  def owner
    self.users.first
---
SELECT  "users".* FROM "users" INNER JOIN "rental_contracts" ON "users"."id" = "rental_contracts"."user_id" WHERE "rental_contracts"."rental_id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["rental_id", 3], ["LIMIT", 1]]