app/models/sale.rb

  def owner
    self.users.first
---
SELECT  "users".* FROM "users" INNER JOIN "sale_contracts" ON "users"."id" = "sale_contracts"."user_id" WHERE "sale_contracts"."sale_id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["sale_id", 1], ["LIMIT", 1]]