app/views/sales/edit.html.erb

SELECT "users".* FROM "users"
---
  <p>
    <%= f.collection_select :user_ids, User.all, :id, :username %>